// prob2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>
#include <fstream>
int main() {
	int t = 0;
	double accepted_c = 0.0;
	std::cin >> t;
	double x, y = 0.0;
	for (int iSet = 0; iSet < t; iSet++) {
		std::cin >> x >> y;
		if (((pow(x, 2) + pow(y, 2)) > 1) && ((x <= 2) && (x >= -2)) && ((y <= 1) && (y >= -1))) {
			accepted_c += 1;
		}
	}
	std::cout << accepted_c/t*100;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
